Tekla Open API Reference for Tekla Structures 2025
Load.LoadSpanningEnum Enumeration
 The load spanning.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LoadSpanningEnum
Public Enumeration LoadSpanningEnum
Members
Member name | Value | Description
LOAD_SPANNING_SINGLE | 1 |  Single spanning.
LOAD_SPANNING_DOUBLE | 2 |  Double spanning.
See Also
Reference
Tekla.Structures.Model Namespace